##просмотр конфига
Router(config)#do show running-config
#поднятие интерфейса
Router(config)# interface fa0/0
Router(config-if)#no shutdown
Router(config-if)#ip address 192.168.1.1 255.255.255.0
#заводим юзера
Router(config)#aaa new-model
Router(config)#username admin secret 12345
##ssh 
#нащначение хостнейма и домайн нейма
Router(config)#hostname R0
R0(config)#ip domain-name example.com
#генерация ключа
R0(config)#crypto key generate rsa 1024
R0(config)#line vty 0 4
R0(config-line)#transport input ssh
#privelege levels - "root" сразу при получении tty
Router(config)#line vty 0 4
Router(config-line)privilege level 15
#настройка прав отдельного юзера
##добавляем юзера
Router(config)#username USER privilege 2 secret  PASSW
##при входе "$ enable 2"
Router(config)#privilege exec level 2 show running-config
## pass for level 2
Router(config)#enable secret level 2 PASS_FOR_LVL2
