; Cisco Discovery Protocol - протокол обнаружения устройств Cisco.
; Позволяет получить базовую информацию о соседних маршрутизаторах и коммутаторах.
; Чтобы получить информацию, устройства рассылают CDP-сообщения через все свои
; работающие интерфейсы.
;
; Информация которую можно получить из CDP
- device identifier : Идентификатор устройства, обычно это название устройства.
- address list      : Список адресов
- local interface   : Локальный интерфейс устройства, на котором была использована команда show cdp
; и через который было обнаружено соседнее устройство.
- port identifier   : Идентификатор соседнего порта указывает, каким интерфейсом к общей среде подключено 
; соседнее устройство.
- capabilities list : Тип соседнего устройства.
- platform          : Показывает модель соседнего устройства.
;
; Наиболее используемые команды 
> show cdp neightbors [тип номер] - Выводит в одну строку информации для всех соседних устройств 
; или для устройства обнаруженного через указанный интерфейс.
> show cdp neightbors detail - Выводит подробную информацию для всех 
; обнаруженных устройств.
> show cdp entry [название] - Выдает подробную информацию с указанным именем.
;
; CDP включен стандартно. ЧЧтобы не дать возможность атакующему получить 
; информацию о сети, протокол CDP должен быть отключен на тех интерфейсах на которых
; он не нужен. Скорее всего CDP будет полезен только на соединениях с другими марш
; рутизаторами и коммутаторами, а так же в интерфейсах к которым подключены IP-теле
; фоны Cisco.
;
; Чтобы отключить CDP на интерфейсах необходимо выполнить.
> Switch(config)#interface range fastEthernet 0/1 - 24
> Switch(config-if-range)#no cdp enable 
; Если CDP не нужен вообще, в глобальной конфигурации устройства нужно выполнить
> Switch(config)#no cdp run
; Для включения.
Switch(config)#cdp run
;

