# В IOS предумсмотрен механизм двух конфигов(файлов), один running-config - текущий конфиг
# хранится в RAM, второй startup-confog(NVRAM-энергонезависимая память) - зашружается когда устройство стартует,
# если ранинг-конфиг не будет записан в NVRAM, то при перезагрузке текущий конфиг будет утерян.
# чтобы посмотреть текущий конфиг.
Router#do show running-config
# чтобы посмотреть конфиг стартовой конфигурации.
Router#show startup-config
#Чтобы записать текущий конфиг в стартовый
Router#write
#Либо
Router# copy running-config startup-config
#Конфиг может быть скопирован на tftp
Router# copy running-config tftp
# Комманда copy всегда заменяет существующий файл на копируемый как mv(unix).
# Другим словами, копируя конфиг из NVRAM startup-config на tftp, мы удаляем конфиг из NVRAMM
# и кладём его на tftp. При копировании файла из tftp в RAM, файл running-config дополняется.
# Чтобы записать конфиг выполняем
Router#write
# Чтобы сбросить конфиг выполняем
Router# erise startup-config
# и перезагружаем устройство
Router# reload
#назначение хостнейма
Router(config)#hostname R0
R0(config)#ip domain-name R0.example.com
# Пароль на привелигерованный режим
R0#conf t
R0(config)#enable secret cisco
#чтобы убрать пароль 
R0(config)#no neable secret
# MOTD
R0(config)#banner motd 'hello cisco'
# Буфер истории комманд
R0>show history
# Размер буфера
R0> history size x
#Назначение IP vlan 1
catalyst#conf t
catalyst(config)# interface vlan 1
catalyst(config-if)#no shutdown
catalyst(config-if)#ip address 192.168.1.1 255.255.255.0
#Динамическое получение IP
catalyst(config-if)#ip address dhcp
#Информация по dhcp-client
catalyst#show dhcp lease

#настройка диапазона интерфейсов
catalyst(config)# interfaces range FA 0/1 - 20

#заводим юзера
Router(config)#aaa new-model
Router(config)#username admin secret 12345

##ssh 
## В коммутаторах компании Cisco консольный порт обозначается как специализированная линия, а именно как консольная линия 0.
## устройство поддерживает 16 одновременных сеансов telnet, нумерумых от 0 до 15.
## комманда 'line vty 0 15' указывает устройству что следующие за ней строки будут применены ко всем возможным
## виртуальным терминальным соединениям с устройством.
# В старых версиях операционной системы поддерживалось только пять одновременных удалённых сиансов
# или vty-линий с 0 по 4


#генерация открытого ключа
R0(config)#crypto key generate rsa 1024
R0(config)#line vty 0 4
#включение ssh
R0(config-line)#transport input ssh

#privelege levels - "root" сразу при получении tty
Router(config)#line vty 0 4
Router(config-line)privilege level 15
#настройка прав отдельного юзера

##добавляем юзера c уровнем доступа 2
Router(config)#username USER privilege 2 secret  PASSW
##при входе "$ enable 2"
Router(config)#privilege exec level 2 show running-config
## pass for level 2
Router(config)#enable secret level 2 PASS_FOR_LVL2
